openwch/ch32m030/EVT/EXAM/SRC/Peripheral/inc/ch32m030_tim.h
/********************************** (C) COPYRIGHT  *******************************
 * File Name          : ch32m030_tim.h
 * Author             : WCH
 * Version            : V1.0.0
 * Date               : 2024/09/01
 * Description        : This file contains all the functions prototypes for the
 *                      TIM firmware library.
*********************************************************************************
* Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#ifndef __CH32M030_TIM_H
#define __CH32M030_TIM_H

#ifdef __cplusplus
extern "C" {
#endif

#include "ch32m030.h"

/* TIM Time Base Init structure definition */
typedef struct
{
    uint16_t TIM_Prescaler; /* Specifies the prescaler value used to divide the TIM clock.
                               This parameter can be a number between 0x0000 and 0xFFFF.
                               @note This parameter is valid for TIM1 ,TIM2 and TIM3. */

    uint16_t TIM_CounterMode; /* Specifies the counter mode.
                                 This parameter can be a value of @ref TIM_Counter_Mode.
                                 @note This parameter is valid for TIM1 and TIM2. */

    uint16_t TIM_Period; /* Specifies the period value to be loaded into the active
                            Auto-Reload Register at the next update event.
                            This parameter must be a number between 0x0000 and 0xFFFF.
                            @note This parameter is valid for TIM1 ,TIM2 and TIM3. */

    uint16_t TIM_ClockDivision; /* Specifies the clock division.
                                  This parameter can be a value of @ref TIM_Clock_Division_CKD
                                  @note This parameter is valid for TIM1 and TIM2. */

    uint8_t TIM_RepetitionCounter; /* Specifies the repetition counter value. Each time the RCR downcounter
                                      reaches zero, an update event is generated and counting restarts
                                      from the RCR value (N).
                                      This means in PWM mode that (N+1) corresponds to:
                                         - the number of PWM periods in edge-aligned mode
                                         - the number of half PWM period in center-aligned mode
                                      This parameter must be a number between 0x00 and 0xFF.
                                      @note This parameter is valid only for TIM1. */
} TIM_TimeBaseInitTypeDef;

/* TIM Output Compare Init structure definition */
typedef struct
{
    uint16_t TIM_OCMode; /* Specifies the TIM mode.
                            This parameter can be a value of @ref TIM_Output_Compare_and_PWM_modes
                            */

    uint16_t TIM_OutputState; /* Specifies the TIM Output Compare state.
                                 This parameter can be a value of @ref TIM_Output_Compare_state
                                 */

    uint16_t TIM_OutputNState; /* Specifies the TIM complementary Output Compare state.
                                  This parameter can be a value of @ref TIM_Output_Compare_N_state
                                  */

    uint16_t TIM_Pulse; /* Specifies the pulse value to be loaded into the Capture Compare Register.
                           This parameter can be a number between 0x0000 and 0xFFFF
                           */

    uint16_t TIM_OCPolarity; /* Specifies the output polarity.
                                This parameter can be a value of @ref TIM_Output_Compare_Polarity */

    uint16_t TIM_OCNPolarity; /* Specifies the complementary output polarity.
                                 This parameter can be a value of @ref TIM_Output_Compare_N_Polarity
                                 */

    uint16_t TIM_OCIdleState; /* Specifies the TIM Output Compare pin state during Idle state.
                                 This parameter can be a value of @ref TIM_Output_Compare_Idle_State
                                 */

    uint16_t TIM_OCNIdleState; /* Specifies the TIM Output Compare pin state during Idle state.
                                  This parameter can be a value of @ref TIM_Output_Compare_N_Idle_State
                                  */
} TIM_OCInitTypeDef;

/* TIM Input Capture Init structure definition */
typedef struct
{
    uint16_t TIM_Channel; /* Specifies the TIM channel.
                             This parameter can be a value of @ref TIM_Channel
                             @note This parameter is valid for TIM1 and TIM2. */

    uint16_t TIM_ICPolarity; /* Specifies the active edge of the input signal.
                                This parameter can be a value of @ref TIM_Input_Capture_Polarity
                                @note This parameter is valid for TIM1 and TIM2. */

    uint16_t TIM_ICSelection; /* Specifies the input.
                                 This parameter can be a value of @ref TIM_Input_Capture_Selection
                                 @note This parameter is valid for TIM1 and TIM2. */

    uint16_t TIM_ICPrescaler; /* Specifies the Input Capture Prescaler.
                                 This parameter can be a value of @ref TIM_Input_Capture_Prescaler
                                 @note This parameter is valid for TIM1 and TIM2. */

    uint16_t TIM_ICFilter; /* Specifies the input capture filter.
                              This parameter can be a number between 0x0 and 0xF
                              @note This parameter is valid for TIM1 and TIM2. */
} TIM_ICInitTypeDef;

/* BDTR structure definition */
typedef struct
{
    uint16_t TIM_OSSRState; /* Specifies the Off-State selection used in Run mode.
                               This parameter can be a value of @ref OSSR_Off_State_Selection_for_Run_mode_state
                               @note This parameter is valid only for TIM1. */

