openwch/ch32m030/EVT/EXAM/SRC/Peripheral/inc/ch32m030_tim.h
/* TIM_Channelx */
#define TIM_Channel_1N                     ((uint16_t)0x1000)
#define TIM_Channel_2N                     ((uint16_t)0x2000)
#define TIM_Channel_3N                     ((uint16_t)0x4000)
#define TIM_Channel_5                      ((uint16_t)0x0400)

/* TIM_DTCR_Polarity */
#define TIM_DTPolarity_Rising              ((uint16_t)0x0000)
#define TIM_DTPolarity_Falling             ((uint16_t)0x0004)

void       TIM_DeInit(TIM_TypeDef *TIMx);
void       TIM_TimeBaseInit(TIM_TypeDef *TIMx, TIM_TimeBaseInitTypeDef *TIM_TimeBaseInitStruct);
void       TIM_OC1Init(TIM_TypeDef *TIMx, TIM_OCInitTypeDef *TIM_OCInitStruct);
void       TIM_OC2Init(TIM_TypeDef *TIMx, TIM_OCInitTypeDef *TIM_OCInitStruct);
void       TIM_OC3Init(TIM_TypeDef *TIMx, TIM_OCInitTypeDef *TIM_OCInitStruct);
void       TIM_OC4Init(TIM_TypeDef *TIMx, TIM_OCInitTypeDef *TIM_OCInitStruct);
void       TIM_ICInit(TIM_TypeDef *TIMx, TIM_ICInitTypeDef *TIM_ICInitStruct);
void       TIM_PWMIConfig(TIM_TypeDef *TIMx, TIM_ICInitTypeDef *TIM_ICInitStruct);
void       TIM_BDTRConfig(TIM_TypeDef *TIMx, TIM_BDTRInitTypeDef *TIM_BDTRInitStruct);
void       TIM_TimeBaseStructInit(TIM_TimeBaseInitTypeDef *TIM_TimeBaseInitStruct);
void       TIM_OCStructInit(TIM_OCInitTypeDef *TIM_OCInitStruct);
void       TIM_ICStructInit(TIM_ICInitTypeDef *TIM_ICInitStruct);
void       TIM_BDTRStructInit(TIM_BDTRInitTypeDef *TIM_BDTRInitStruct);
void       TIM_Cmd(TIM_TypeDef *TIMx, FunctionalState NewState);
void       TIM_CtrlPWMOutputs(TIM_TypeDef *TIMx, FunctionalState NewState);
void       TIM_ITConfig(TIM_TypeDef *TIMx, uint16_t TIM_IT, FunctionalState NewState);
void       TIM_GenerateEvent(TIM_TypeDef *TIMx, uint16_t TIM_EventSource);
void       TIM_DMAConfig(TIM_TypeDef *TIMx, uint16_t TIM_DMABase, uint16_t TIM_DMABurstLength);
void       TIM_DMACmd(TIM_TypeDef *TIMx, uint16_t TIM_DMASource, FunctionalState NewState);
void       TIM_InternalClockConfig(TIM_TypeDef *TIMx);
void       TIM_ITRxExternalClockConfig(TIM_TypeDef *TIMx, uint16_t TIM_InputTriggerSource);
void       TIM_TIxExternalClockConfig(TIM_TypeDef *TIMx, uint16_t TIM_TIxExternalCLKSource,
                                      uint16_t TIM_ICPolarity, uint16_t ICFilter);
void       TIM_ETRClockMode1Config(TIM_TypeDef *TIMx, uint16_t TIM_ExtTRGPrescaler, uint16_t TIM_ExtTRGPolarity,
                                   uint16_t ExtTRGFilter);
void       TIM_ETRClockMode2Config(TIM_TypeDef *TIMx, uint16_t TIM_ExtTRGPrescaler,
                                   uint16_t TIM_ExtTRGPolarity, uint16_t ExtTRGFilter);
void       TIM_ETRConfig(TIM_TypeDef *TIMx, uint16_t TIM_ExtTRGPrescaler, uint16_t TIM_ExtTRGPolarity,
                         uint16_t ExtTRGFilter);
void       TIM_PrescalerConfig(TIM_TypeDef *TIMx, uint16_t Prescaler, uint16_t TIM_PSCReloadMode);
void       TIM_CounterModeConfig(TIM_TypeDef *TIMx, uint16_t TIM_CounterMode);
void       TIM_SelectInputTrigger(TIM_TypeDef *TIMx, uint16_t TIM_InputTriggerSource);
void       TIM_EncoderInterfaceConfig(TIM_TypeDef *TIMx, uint16_t TIM_EncoderMode,
                                      uint16_t TIM_IC1Polarity, uint16_t TIM_IC2Polarity);
void       TIM_ForcedOC1Config(TIM_TypeDef *TIMx, uint16_t TIM_ForcedAction);
void       TIM_ForcedOC2Config(TIM_TypeDef *TIMx, uint16_t TIM_ForcedAction);
void       TIM_ForcedOC3Config(TIM_TypeDef *TIMx, uint16_t TIM_ForcedAction);
void       TIM_ForcedOC4Config(TIM_TypeDef *TIMx, uint16_t TIM_ForcedAction);
void       TIM_ARRPreloadConfig(TIM_TypeDef *TIMx, FunctionalState NewState);
void       TIM_SelectCOM(TIM_TypeDef *TIMx, FunctionalState NewState);
void       TIM_SelectCCDMA(TIM_TypeDef *TIMx, FunctionalState NewState);
void       TIM_CCPreloadControl(TIM_TypeDef *TIMx, FunctionalState NewState);
void       TIM_OC1PreloadConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCPreload);
void       TIM_OC2PreloadConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCPreload);
void       TIM_OC3PreloadConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCPreload);
void       TIM_OC4PreloadConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCPreload);
void       TIM_OC5PreloadConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCPreload);
void       TIM_OC6PreloadConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCPreload);
void       TIM_OC7PreloadConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCPreload);
void       TIM_OC8PreloadConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCPreload);
void       TIM_OC1FastConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCFast);
void       TIM_OC2FastConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCFast);
void       TIM_OC3FastConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCFast);
void       TIM_OC4FastConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCFast);
void       TIM_ClearOC1Ref(TIM_TypeDef *TIMx, uint16_t TIM_OCClear);
void       TIM_ClearOC2Ref(TIM_TypeDef *TIMx, uint16_t TIM_OCClear);
void       TIM_ClearOC3Ref(TIM_TypeDef *TIMx, uint16_t TIM_OCClear);
void       TIM_ClearOC4Ref(TIM_TypeDef *TIMx, uint16_t TIM_OCClear);
void       TIM_ClearOC5Ref(TIM_TypeDef *TIMx, uint16_t TIM_OCClear);
void       TIM_OC1PolarityConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCPolarity);
void       TIM_OC1NPolarityConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCNPolarity);
void       TIM_OC2PolarityConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCPolarity);
void       TIM_OC2NPolarityConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCNPolarity);
void       TIM_OC3PolarityConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCPolarity);
void       TIM_OC3NPolarityConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCNPolarity);
void       TIM_OC4PolarityConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCPolarity);
void       TIM_OC5PolarityConfig(TIM_TypeDef *TIMx, uint16_t TIM_OCPolarity);
void       TIM_CCxCmd(TIM_TypeDef *TIMx, uint16_t TIM_Channel, uint16_t TIM_CCx);
void       TIM_CCxNCmd(TIM_TypeDef *TIMx, uint16_t TIM_Channel, uint16_t TIM_CCxN);
void       TIM_SelectOCxM(TIM_TypeDef *TIMx, uint16_t TIM_Channel, uint16_t TIM_OCMode);
void       TIM_UpdateDisableConfig(TIM_TypeDef *TIMx, FunctionalState NewState);
void       TIM_UpdateRequestConfig(TIM_TypeDef *TIMx, uint16_t TIM_UpdateSource);
void       TIM_SelectHallSensor(TIM_TypeDef *TIMx, FunctionalState NewState);
void       TIM_SelectOnePulseMode(TIM_TypeDef *TIMx, uint16_t TIM_OPMode);
void       TIM_SelectOutputTrigger(TIM_TypeDef *TIMx, uint16_t TIM_TRGOSource);
void       TIM_SelectSlaveMode(TIM_TypeDef *TIMx, uint16_t TIM_SlaveMode);
void       TIM_SelectMasterSlaveMode(TIM_TypeDef *TIMx, uint16_t TIM_MasterSlaveMode);
void       TIM_SetCounter(TIM_TypeDef *TIMx, uint16_t Counter);
void       TIM_SetAutoreload(TIM_TypeDef *TIMx, uint16_t Autoreload);
void       TIM_SetCompare1(TIM_TypeDef *TIMx, uint16_t Compare1);
void       TIM_SetCompare2(TIM_TypeDef *TIMx, uint16_t Compare2);
void       TIM_SetCompare3(TIM_TypeDef *TIMx, uint16_t Compare3);
void       TIM_SetCompare4(TIM_TypeDef *TIMx, uint16_t Compare4);
void       TIM_SetCompare5(TIM_TypeDef *TIMx, uint16_t Compare5);
void       TIM_SetCompare6(TIM_TypeDef *TIMx, uint16_t Compare6);
void       TIM_SetCompare7(TIM_TypeDef *TIMx, uint16_t Compare7);
void       TIM_SetCompare8(TIM_TypeDef *TIMx, uint16_t Compare8);
void       TIM_SetIC1Prescaler(TIM_TypeDef *TIMx, uint16_t TIM_ICPSC);
void       TIM_SetIC2Prescaler(TIM_TypeDef *TIMx, uint16_t TIM_ICPSC);
void       TIM_SetIC3Prescaler(TIM_TypeDef *TIMx, uint16_t TIM_ICPSC);
void       TIM_SetIC4Prescaler(TIM_TypeDef *TIMx, uint16_t TIM_ICPSC);
void       TIM_SetClockDivision(TIM_TypeDef *TIMx, uint16_t TIM_CKD);
uint16_t   TIM_GetCapture1(TIM_TypeDef *TIMx);
uint16_t   TIM_GetCapture2(TIM_TypeDef *TIMx);
uint16_t   TIM_GetCapture3(TIM_TypeDef *TIMx);
uint16_t   TIM_GetCapture4(TIM_TypeDef *TIMx);
uint16_t   TIM_GetCounter(TIM_TypeDef *TIMx);
uint16_t   TIM_GetPrescaler(TIM_TypeDef *TIMx);
FlagStatus TIM_GetFlagStatus(TIM_TypeDef *TIMx, uint16_t TIM_FLAG);
void       TIM_ClearFlag(TIM_TypeDef *TIMx, uint16_t TIM_FLAG);
ITStatus   TIM_GetITStatus(TIM_TypeDef *TIMx, uint16_t TIM_IT);
void       TIM_ClearITPendingBit(TIM_TypeDef *TIMx, uint16_t TIM_IT);
void       TIM_IndicateCaptureLevelCmd(TIM_TypeDef *TIMx, FunctionalState NewState);
void       TIM2_DeadTimeConfig(TIM_TypeDef *TIMx, uint16_t TIM_Channel, uint8_t DeadTime, uint8_t DT_DIV);
void       TIM3_DeadTimeConfig(TIM_TypeDef *TIMx, uint16_t TIM_Channel, uint8_t DeadTime, uint8_t DT_DIV);
void       TIM_CLKSourceConfig(TIM_TypeDef *TIMx, uint32_t TIM_CLKSource);
void       TIM_CapEdgeADC_Cmd(TIM_TypeDef *TIMx, FunctionalState NewState);
void       TIM_IC2BothEdge_Cmd(TIM_TypeDef *TIMx, FunctionalState NewState);
void       TIM_IC3BothEdge_Cmd(TIM_TypeDef *TIMx, FunctionalState NewState);
void       TIM_IC4BothEdge_Cmd(TIM_TypeDef *TIMx, FunctionalState NewState);
void       TIM_AsymmetricDeadTimeConfig(TIM_TypeDef *TIMx, uint8_t AsymmetricDeadTime, uint16_t DT_MODE);
void       TIM_CenterAlignedMoveToward_Cmd(TIM_TypeDef *TIMx, FunctionalState NewState);
void       TIM_IndependentOutput_ChannelxN_Cmd(TIM_TypeDef *TIMx, uint16_t TIM_Channel, FunctionalState NewState);
void       TIM_ChannelxPWMModeConfig(TIM_TypeDef *TIMx, uint16_t TIM_Channel, uint16_t TIM_OCMode);
void       TIM2_CH2PWMOUTPinConfig(TIM_TypeDef *TIMx, FunctionalState NewState);

#ifdef __cplusplus
}
#endif

#endif /*__CH32M030_TIM_H */
